<template>
  <main class="main-container">
    <RulesSection :ruleCategories="ruleCategories" @toggle-rules="toggleRules" />
  </main>
</template>

<script>
import RulesSection from '@/components/rules/components/RulesSection.vue';

export default {
  name: 'MainContainer',
  components: {
    RulesSection
  },
  data() {
    return {
      ruleCategories: [
        {
          title: 'Правила проекта',
          blocks: [
            {
              id: '1',
              title: 'Общие правила',
              open: false,
              rules: [
                {
                  id: '1.1 ',
                  text: `Любой зарегистрировавшийся на проекте, соглашается со всеми правилами ниже и обязуется их выполнять.
                Незнание правил не освобождает от ответственности.`,
                },
                {
                  id: '1.2 ',
                  text: `Данный свод правил может быть изменен в любой момент.`,
                },
                {
                  id: '1.3 ',
                  text: `Сервис бесплатен и предоставляется «как есть» без каких–либо гарантий правильной работы.
                Команда проекта оставляет за собой право не возвращать вещи, потерянные в результате: "бага",
                "отката", "смерти игрока", "нестабильной работы серверов", "игровой ситуации" и т.п.`,
                },
                {
                  id: '1.4 ',
                  text: `Игрок сам несет ответственность за безопасность своего аккаунта и обязуется соблюдать все надлежащие меры по обеспечению его защиты.<br>
                Независимо от того, кем были совершены действия на аккаунте, ответственность за него всегда несет его владелец.<br>
                В случае взлома аккаунта администрация проекта оставляет за собой право отказать в восстановлении доступа. Кроме этого, взлом аккаунта не является оправданием, если игрок обвиняется в нарушении правил.`,
                },
                {
                  id: '1.5 ',
                  text: `Администрация игрового проекта имеет полное право аннулировать/заблокировать твой аккаунт без возможности платного разбана.`,
                },
                {
                  id: '1.6 ',
                  text: `Запрещено использовать мультиаккаунты для:`,
                  subRules: [
                    { text: `собственного обогащения <br> Например: прохождение квестов для получения ресурсов <br>
                    Исключение: награда за голосование за проект` },
                    { text: `намеренного нарушения правил и т.п. <br> Если у игрока имеется уже забаненный аккаунт, то в случае нарушений модерация в праве банить последующие аккаунты игрока на максимально возможный срок.` },
                  ],
                  note: `Наказание: Бан твинк-аккаунта навсегда.`,
                },
                {
                  id: '1.7 ',
                  text: `В случае необходимости игрок может быть забанен/телепортирован на спавн модерацией на время разрешения инцидента с нарушением правил. <br>
                   Команда проекта имеет право действовать "по ситуации" в том случае, если сочтет это необходимым.`,
                  note: `Под "необходимостью" имеются в виду угроза нормальной работоспособности сервера/проекта/команды проекта, нагрузка сервера различными способами, и т.п.`,
                },
                {
                  id: '1.7.1 ',
                  text: `Запрещено любыми способами нарушать работу серверов.`,
                  note: `Наказание: Ликвидирование/снос угрозы без предупреждений.`,
                },
                {
                  id: '1.8 ',
                  text: `Запрещена передача/попытка передачи аккаунта третьим лицам.`,
                  note: `Наказание: Бан навсегда.`,
                },
                {
                  id: '1.9 ',
                  text: `Любые игровые ценности игрока могут быть изъяты и удалены в случаях, если эти игровые ценности были получены нечестным путем. <br>
                   Например: При нарушении п.п. 2.11, взломе, гриферстве, дюпе, в результате ошибки в работе сервера и т.д.`,
                },
                {
                  id: '1.10 ',
                  text: `Запрещено регистрировать никнеймы и префиксы, прямо или косвенно нарушающие другие пункты правил, а также:`,
                  subRules: [
                    { text: `нарушают нормы морали и приличия, несут оскорбительный, нецензурный или сексуальный (порнографический) характер` },
                    { text: `содержат упоминание наркотических/психотропных веществ (а также слова и аббревиатуры, намекающие на данные вещества)` },
                    { text: `схожи с никами Команды проекта` },
                    { text: `содержащие явную отсылку к Команде проекта` },
                    { text: `имеют рекламный подтекст (реклама сервера, групп, проектов)` },
                  ],
                  note: `Наказание: Бан навсегда.`,
                },
                {
                  id: '1.11 ',
                  text: `Запрещено устанавливать скины и плащи:`,
                  subRules: [
                    { text: `нарушают нормы морали и приличия, несут оскорбительный, нецензурный или сексуальный (порнографический) характер` },
                    { text: `содержат упоминание наркотических/психотропных веществ` },
                    { text: `содержащие политическую/военную/нацистскую символику и знаки` },
                    { text: `имеющие отношение к политике/нацизму` },
                  ],
                  note: `Наказание: Бан от 1 до 7 дней. <br>
                   При повторном нарушении: Бан навсегда.`,
                },
                {
                  id: '1.12 ',
                  text: `Жалобы на форум принимаются не позднее 2 дней с момента той или иной ситуации. <br>
                   Также Команда проекта вправе отказать тебе, если ты не можешь предоставить весомых доказательств того или иного нарушения. <br>
                   Используя форум и правильно составив свою жалобу, ты помогаешь ее скорейшему рассмотрению и решению.`,
                },
                {
                  id: '1.12.1 ',
                  text: `На обжалование наказания дается 2 дня с момента получения наказания`,
                  note: `Наказание: Ликвидирование/снос угрозы без предупреждений.`,
                },
                {
                  id: '1.12.2 ',
                  text: `Запрещено лжесвидетельствовать против игроков, подделывать доказательства, шантажировать доказательствами игрока и тд.`,
                  note: `Наказание: Бан от 1 до 7 дней.`,
                },
                {
                  id: '1.13 ',
                  text: `Запрещено использовать или обсуждать изменения файлов клиента, дюпы, ошибки (баги) в работе серверов, а также:`,
                  subRules: [
                    { text: `любые сторонние программы, дающие преимущества в игре` },
                    { text: `распространять предметы, добытые нечестным путем` },
                  ],
                  note: `Наказание: Бан навсегда.`,
                },
                {
                  id: '1.13.1 ',
                  text: `Все игроки, замеченные в помощи, либо состоявшие в регионе, на котором происходило нарушение, также являются нарушителями.`,
                  note: `Наказание: Бан от 2 дней до Бана навсегда.`,
                },
                {
                  id: '1.13.2 ',
                  text: `Любые действия, направленные на помощь забаненному игроку (до/после бана), могут расцениваться как соучастие.`,
                  note: `Наказание: Бан от 2 до 30 дней.`,
                },
                {
                  id: '1.14 ',
                  text: `Персонал проекта вправе выбирать степень и меру наказания, руководствуясь здравым смыслом.`,
                },
              ],
            },
            {
              id: '2',
              title: 'Игровой процесс',
              open: false,
              rules: [
                {
                  id: '2.1 ',
                  text: `Регулирование отношений внутри региона происходит самими игроками. <br>
                   Все игроки, добавленные в приват, являются полноправными владельцами ресурсов. <br>
                   Команда проекта не несет ответственность за тех, кого вы добавили в приват. <br>
                   Важно: Для того, чтобы обезопасить самого себя, при добавлении человека в регион сохраняйте скриншот слов этого игрока в чате о том, что он тебя не загриферит.`,
                  note: `Наказание: Бан до 3 дней. <br>
                   При повторном нарушении: Бан от 3 до 7 дней.`,
                },
                {
                  id: '2.2 ',
                  text: `Запрещены любые нарушения правил в названиях:`,
                  subRules: [
                    { text: `регионов` },
                    { text: `предметов` },
                    { text: `варпов` },
                    { text: `животных и т.д. <br>
                       Если у игрока имеется уже забаненный аккаунт, то в случае нарушений модерация в праве банить последующие аккаунты игрока на максимально возможный срок.` },
                  ],
                  note: `Наказание: Предупреждение и удаление <br>
                   При повторном нарушении: Бан от 1 до 7 дней.`,
                },
                {
                  id: '2.3 ',
                  text: `Запрещено публичное создание объектов нарушающих правила проекта. А также содержащие:`,
                  subRules: [
                    { text: `эротический или аморальный характер` },
                    { text: `оскорбления/маты/ненормативную лексику` },
                    { text: `нацистскую, политическую, дискриминационную, военную символику и смысл.` },
                    { text: `рекламу, не имеющую отношения к игровому серверу` },
                  ],
                  note: `Наказание: Предупреждение и снос постройки <br>
                   При повторном нарушении: Бан до 7 дней.`,
                },
                {
                  id: '2.3.1 ',
                  text: `Запрещено транслировать аудио-контент в публичных местах, которое прямо или косвенно нарушает правила проекта. <br>
                   Уточнение: в голосовом чате разрешено негрубое нарушение п.п. 3.2, 3.3, если это не публичное место и не мешает другим игрокам.`,
                  note: `Наказание: Предупреждение. <br>
                   При повторном нарушении: Снос постройки и мут до 3 часов.`,
                },
                {
                  id: '2.4 ',
                  text: `Запрещены любые нарушения правил в общественных местах. <br>
                   Общественным местом являются места:`,
                  subRules: [
                    { text: `публичные места сервера` },
                    { text: `на которых присутствует публичный варп` },
                    { text: `в которые можно попасть, не прибегая к каким-либо "багам" и т.п.` },
                  ],
                  note: `Наказание: Предупреждение и снос постройки <br>
                   При повторном нарушении: Бан до 3 дней.`,
                },
                {
                  id: '2.5 ',
                  text: `Запрещено намеренно портить внешний вид карты в строительном мире. В том числе:`,
                  subRules: [
                    { text: `запрещено оставлять столбы (если они не используются для разметки)` },
                    { text: `запрещается рыть глубокие ямы, способные убить/нанести большой урон при падении в них, а также ямы, которые закрывают доступ к региону другого игрока;` },
                  ],
                  note: `Наказание: Снос постройки и предупреждение. <br>
                   При повторном нарушении: Бан от 1 дня.`,
                },
                {
                  id: '2.6 ',
                  text: `Запрещено наносить вред игроку, в том числе следующими способами:`,
                  subRules: [
                    { text: `гриферством` },
                    { text: `создавая регион ближе, чем 3 чанка к чужому <br>
                       Исключение: договоренности между игроками` },
                    { text: `создавая регион под/над регионом другого игрока` },
                    { text: `строить что-либо рядом с регионом или вплотную без согласия участников этого региона` },
                    { text: `блокировать доступ к чужому региону, выкапывая рвы и ямы вокруг чужого региона` },
                    { text: `устанавливая рядом с приватом сирены, радио и т.п.` },
                    { text: `выкидывать ресурсы в больших кол-вах на территорию привата и т.п.` },
                    { text: `мешать комфортной игре других игроков` },
                    { text: `находится на чужом регионе, если того не желает владелец региона` },
                    { text: `создавать точки дома рядом с регионом игроков` },
                    { text: `отслеживание одних и тех же игроков с целью убийства` },
                    { text: `телепортация на чужие регионы посредством отметок в релокаторе и тд. с целью убийства` },
                    { text: `сталкивать игроков собой или существами` },
                    { text: `блокировать, закрывать посещение острова модерации сервера любыми способами, в том числе "/is ban", "/is kick"` },
                  ],
                  note: `Наказание: Бан до 1 дня. <br>
                   При повторном нарушении: Бан от 1 дня до 7 дней.`,
                },
                {
                  id: '2.7 ',
                  text: `Запрещено каким-либо образом обходить защиту системы приватов и флагов.`,
                  note: `Наказание: Бан от 3 до 5 дней. <br>
                   При повторном нарушении: Бан навсегда.`,
                },
                {
                  id: '2.7.1 ',
                  text: `Запрещено любыми способами убивать игроков в регионе, где отключено PvP/работает бессмертие.`,
                  note: `Наказание: Бан до 1 дня. <br>
                   При повторном нарушении: Бан от 1 до 7 дней.`,
                },
                {
                  id: '2.8 ',
                  text: `Запрещено создавать публичные варпы не в безопасном месте. <br>
                   Под небезопасными местами подразумевается варп, установленный:`,
                  subRules: [
                    { text: `в воздухе` },
                    { text: `в или над лавой/огнем` },
                    { text: `в воде/под водой` },
                  ],
                  note: `Наказание: Предупреждение и удаление варпа. <br>
                   При повторном нарушении: Бан от 12 часов до 1 дня.`,
                },
                {
                  id: '2.9 ',
                  text: `Запрещено убивать игроков после телепортации в том случае, если:`,
                  subRules: [
                    { text: `игрок телепортируется к жертве или телепортирует жертву к себе и убивает, не выждав 2 минуты` },
                    { text: `игрок имел какой-либо договор с жертвой` },
                  ],
                  note: `Наказание: Бан до 3 дней с изъятием выбитых ресурсов. <br>
                   При повторном нарушении: Бан от 3 до 14 дней.`,
                },
                {
                  id: '2.9.1 ',
                  text: `При совершении сделки, обе стороны обязаны обезопасить данную сделку. <br>
                   Убийство одного из игроков или потеря ресурсов - это вина игрока на чьей территории произошел инцидент.`,
                  note: `Наказание: Бан до 3 дней. <br>
                   При повторном нарушении: Бан от 3 до 10 дней.`,
                },
                {
                  id: '2.10 ',
                  text: `Игрок не обязан возвращать потерянные ресурсы в честном PvP или же случайно выброшенные вещи.`,
                },
                {
                  id: '2.10.1 ',
                  text: `Запрещено находится на PVP-арене с магнитом и его аналогами.`,
                  note: `Наказание: Предупреждение. <br>
                   При повторном нарушении: Бан от 3 до 12 часов.`,
                },
                {
                  id: '2.11 ',
                  text: `Запрещено покупать или продавать игровые ресурсы/аккаунт, предоставлять прочие услуги за реальные деньги или в обмен на другие ценности, не связанные с игрой и проектом.`,
                  note: `Наказание: Бан навсегда.`,
                },
                {
                  id: '2.12 ',
                  text: `Запрещено совершать любые действия, направленные на дестабилизацию экономики сервера:`,
                  subRules: [
                    { text: `передача игровых ценностей для аренды, которые могут ускорить развитие игрока на сервере` },
                    { text: `продажа территории/постройки, в которой имеются любые ресурсы` },
                    { text: `обмен ресурсами (значительно ниже/выше их реальной стоимости, которая может быть указана на предмете или определена на основе стоимости ресурсов для его создания).` },
                    { text: `продажа ресурсов за стоимость меньше минимальной (в некоторых случаях – мин. цена указана на самом предмете. В некоторых рассчитывается из ценности крафта, а не фиксированной цены)` },
                    { text: `раздача/продажа предмета за значительно большую или меньшую стоимость, выбрасывание ресурсов, ломание построек, хранилищ, удаление привата и тд) <br>
                       Любой обход (создание промежуточного региона/добавление в существующий, передача через другой мир и тому подобное) является нарушение данного п.п. <br>
                       Команда проекта оставляет за собой право решать, является ли обмен равноценным.` },
                  ],
                  note: `Наказание: Изъятие ресурсов/Бан от 1 до 7 дней и изъятие ресурсов. <br>
                   При повторном нарушении: Бан навсегда.`,
                },
                {
                  id: '2.12.1 ',
                  text: `Игроки имеют право дарить следующие ресурсы: еду (из ванильных модов), блоки не имеющие ценность.`,
                },
                {
                  id: '2.12.2 ',
                  text: `Находясь в чужом привате запрещено воровать ресурсы любыми способами, в том числе снесенные владельцами привата, а также подбирать любые вещи с целью собственного обогащения.`,
                },
                {
                  id: '2.12.3 ',
                  text: `Запрещено создание афк-варпов с раздачей, а также прогрузка территории за плату.`,
                  note: `Наказание: Предупреждение. <br>
                   При повторном нарушении: Снос постройки.`,
                },
                {
                  id: '2.12.4 ',
                  text: `Любые лотереи/казино/конкурсы/викторины и т.п. должны быть согласованными в обязательном порядке с Командой сервера (Старшим составом).`,
                  note: `Наказание: От предупреждения до бана на 7 дней.`,
                },
                {
                  id: '2.13 ',
                  text: `Запрещено нарушать правила официальных и одобренных ивентов.`,
                  note: `Наказание: От предупреждения до бана на 1 час.`,
                },
                {
                  id: '2.13.1 ',
                  text: `Запрещено использование преимуществ для убийства NPC в местах прохождения квестов.`,
                  note: `Наказание: Бан от 1 до 7 дней. <br>
                   При повторном нарушении: Бан от 7 до 30 дней.`,
                },
                {
                  id: '2.14 ',
                  text: `Запрещено мешать проведению ритуала по воскрешению/убийству дракона.`,
                  note: `Наказание: Изъятие дропа и предупреждение. <br>
                   При повторном нарушении: Бан от 1 до 3 дней.`,
                },
              ],
            },
            {
              id: '3',
              title: 'Общение',
              open: false,
              rules: [
                {
                  id: '3.1 ',
                  text: `Данные правила общения относятся ко всем видам передачи информации на серверах, в том числе: таблички, информационные панели и тд.`,
                },
                {
                  id: '3.2 ',
                  text: `Личные сообщения не модерируются. <br>
                   В локальном чате разрешено негрубое нарушения п.п. 3.2., 3.3..`,
                },
                {
                  id: '3.3 ',
                  text: `Запрещено:`,
                  subRules: [
                    { text: `использовать мат (в том числе завуалированный/исковерканный) или нецензурную лексику в любом виде` },
                    { text: `оскорблять или троллить игроков или их родственников` },
                    { text: `видоизменять никнеймы игроков с целью их оскорбить` },
                    { text: `создавать конфликтные ситуации` },
                    { text: `подстрекать третьи лица на нарушение правил` },
                    { text: `угрожать расправой в реальной жизни` },
                    { text: `разжигать межнациональные розни (расизм, национализм и прочее)` },
                    { text: `обсуждать/призывать к потреблению алкогольной, табачной, наркотической продукции` },
                    { text: `обсуждать военно-политические действия и ситуации` },
                    { text: `обсуждать/призывать к смерти и суициду, в том числе в шуточной форме` },
                    { text: `пропагандировать любую религию` },
                  ],
                  note: `Наказание: Мут до 3 часов. <br>
                   При повторном нарушении: Мут от 3 часов до 3 дней.`,
                },
                {
                  id: '3.3.1 ',
                  text: `Запрещено разглашение личных данных других игроков (место проживания, IP-адрес, личные фотографии, видеозаписи, контакты, социальные сети и т.д).`,
                  note: `Наказание: Бан от 3 до 7 дней. <br>
                   При повторном нарушении: Бан навсегда.`,
                },
                {
                  id: '3.4 ',
                  text: `Запрещено:`,
                  subRules: [
                    { text: `отправлять однотипные сообщения более 3-х раз в 1 минуту` },
                    { text: `рекламировать варп/покупку или продажу товара чаще чем в 5 минут, в том числе разных варпов, ведущих в один и тот же магазин разными игроками` },
                    { text: `спамить, флудить, капсить` },
                  ],
                  note: `Наказание: Мут до 3 часов. <br>
                   При повторном нарушении: Мут от 3 часов до 3 дней.`,
                },
                {
                  id: '3.5 ',
                  text: `Запрещены упоминания сторонних проектов в любом виде.`,
                  note: `Наказание: Бан от 1 дня до бана навсегда.`,
                },
                {
                  id: '3.6 ',
                  text: `Запрещено намеренно засорять чат слишком частыми смертями/убийствами игроков/мобов и т.п.`,
                  note: `Наказание: Предупреждение. <br>
                   При повторном нарушении: Бан до 3 часов.`,
                },
                {
                  id: '3.7 ',
                  text: `Запрещено отправлять в личные сообщения мод. составу:`,
                  subRules: [
                    { text: `оскорбления, флуд, спам, оффтоп и т.п.` },
                    { text: `провокации в любом виде их проявления` },
                    { text: `частые запросы на телепортацию и т.д.` },
                  ],
                  note: `Наказание: От мута на 2 часа до бана на 2 часа. <br>
                   При повторном нарушении: От мута на 4 часа до бана на 4 часа.`,
                },
                {
                  id: '3.8 ',
                  text: `Запрещено публичное и скрытое (обсуждение с игроками в локальном чате или ЛС) навязывание негативного мнения насчет сервера и проекта в целом, критика, оспаривание или обсуждение действий администрации проекта. <br>
                   Для этого существует специальный раздел форума, где можно подать жалобу.`,
                  note: `Наказание: Мут до 1 часа. <br>
                   При повторном нарушении: Мут от 2 часов до 1 дня.`,
                },
                {
                  id: '3.9 ',
                  text: `Запрещено обманывать:`,
                  subRules: [
                    { text: `игроков с целью получения собственной выгоды, а также выдавать себя за члена команды проекта не являясь им` },
                    { text: `команду проекта` },
                  ],
                  note: `Наказание: Бан до 3 дней. <br>
                   При повторном нарушении: Бан от 3 до 7 дней.`,
                },
                {
                  id: '3.10 ',
                  text: `Запрещено распространять ложные сведения о вайпе и изменениях сервера. <br>
                   Обо всех вайпах всегда пишут в новостях на сайте и форуме проекта.`,
                  note: `Наказание: Мут до 2 часов. <br>
                   При повторном нарушении: Мут до 1 дня.`,
                },
              ],
            },
            {
              id: '4',
              title: 'Правила для игроков с привилегией CHAOS/INFINITY',
              open: false,
              rules: [
                {
                  id: '4.1 ',
                  text: `Ты имеешь право игнорировать нарушения других игроков.`,
                },
                {
                  id: '4.2 ',
                  text: `При выдаче наказания (kick, mute, ban, warn) ты обязан указать причину, по которой игрок получил наказание в соответствии с пунктами правилами проекта`,
                },
                {
                  id: '4.2.1 ',
                  text: `Запрещено менять/снимать чужие наказания.`,
                  note: `Наказание: Бан от 1 до 3 дней. <br>
                   При повторном нарушении: Бан навсегда.`,
                },
                {
                  id: '4.3 ',
                  text: `Ты обязан хранить доказательства нарушений (за которые выдаешь наказания) не менее 14 дней, и в случае необходимости (по просьбе Главного Модератора) обязан предоставить их ему.`,
                  note: `Наказание: В случае отказа/не предоставления доказательств нарушения - бан от 1 до 7 дней. <br>
                   В случае бана без причины/некорректной причине - бан от 1 до 7 дней. <br>
                   При повторном нарушении: Бан навсегда.`,
                },
                {
                  id: '4.4 ',
                  text: `При нарушении правил назначенным персоналом сервера, вместо наказания нужно подать жалобу на форуме в разделе для жалоб на Модераторов.`,
                  note: `Наказание: В случае выдачи наказания, бан от 1 до 7 дней. <br>
                   При повторном нарушении: Бан навсегда.`,
                },
                {
                  id: '4.5 ',
                  text: `Запрещено:`,
                  subRules: [
                    { text: `убийство игроков с помощью команд` },
                    { text: `выдача наказаний без причины` },
                    { text: `смена времени суток чаще, чем раз в 10 минут` },
                  ],
                  note: `Наказание: Бан от 1 до 7 дней. <br>
                   При повторном нарушении: Бан навсегда.`,
                },
                {
                  id: '4.6 ',
                  text: `Запрещено выдавать наказания по разделу правил №4, связанные с игроками имеющими привилегии CHAOS/INFINITY. <br>
                   Вместо наказания нужно подать жалобу на форуме в разделе для жалоб на Игроков`,
                  note: `Наказание: Бан от 1 до 3 дней. <br>
                   При повторном нарушении: Бан навсегда.`,
                },
              ],
            },
          ],
        },
        {
          title: 'Правила серверов',
          blocks: [
            {
              id: '5',
              title: 'HiTech 1.20.1',
              open: false,
              rules: [
                {
                  id: '5.1 ',
                  text: `Запрещено любым способом обходить ограничения (указанные ниже, а также в подсказке при наведении на блок в игре):`,
                  subRules: [
                    { text: `<strong>[Mekanism] Динамический резервуар</strong> — не более 1 шт. на команду (9х9х9)` },
                    { text: `<strong>[Mekanism] Индукционная матрица</strong> — не более 1 шт. на команду (9х9х9)` },
                    { text: `<strong>[Mekanism] Термоэлектрический бойлер</strong> — не более 1 шт. на команду (9х9х9)` },
                    { text: `<strong>[Mekanism] Ядерный реактор</strong> — не более 1 шт. на команду (10x10x10)` },
                    { text: `<strong>[Mekanism] Термоядерный реактор</strong> — не более 1 шт. на команду` },
                    { text: `<strong>[Mekanism] Турбина</strong> — не более 2 шт. на команду (9х9х9) или 1 шт. на команду (9х9х17)` },
                  ],
                },
                {
                  id: '5.2 ',
                  text: `Запрещены любые публичные зарядки.`,
                },
                {
                  id: '5.3 ',
                  text: `Все договоры по обмену или продаже не должны выходить за пределы игры. Глобального, локального и
                   личного чата более чем достаточно для заключения сделки. Попытка договориться за пределами игры будет
                   расцениваться как попытка заключить неравноценный обмен/продажа за реал.`,
                },
                {
                  id: '5.4 ',
                  text: `Запрещена любая помеха игрокам проведений ритуалов, использований варпов.`,
                },
              ],
            },
            {
              id: '6',
              title: 'MI:Foundation New 1.19.2',
              open: false,
              rules: [
                {
                  id: '6.1 ',
                  text: `Запрещен любой вид АФК-рыбалки`,
                  note: `Наказание: Изъятие дропа полученного в АФК виде и предупреждение. <br>
                   При повторном нарушении: Бан от 1 до 3 дней.`,
                },
              ],
            },
            {
              id: '7',
              title: 'Ind:Upgrade 1.12.2',
              open: false,
              rules: [
                {
                  id: '7.1 ',
                  text: `При осуществлении бартера с участием предметов с фиксированной минимальной ценой, разрешается её завышение максимально на 10%.`,
                },
                {
                  id: '7.2 ',
                  text: `Запрещено создание лотерей, казино, призом в которых предусмотрены какие-либо ресурсы.`,
                },
                {
                  id: '7.3 ',
                  text: `Запрещено размещение на варпах многоблочных структур из Modular Machinery для публичного пользования.`,
                },
                {
                  id: '7.4 ',
                  text: `Запрещено любым способом обходить ограничения на чанк:`,
                  subRules: [
                    { text: `Ограничение мобов — 4` },
                    { text: `Ограничение на механизмы, описанные в JEI` },
                  ],
                },
                {
                  id: '7.5 ',
                  text: `Запрещено создавать приваты вокруг основного для установки дополнительных механизмов. Список данных механизмов и их ограничение на 1 команду игроков:`,
                  subRules: [
                    { text: `Авто-шахтеры (любого вида) - 8 штук` },
                    { text: `Расширяемая подсистема крафта (любого вида) - 1 штук` },
                    { text: `Ветрогенератора (любого вида) - 16 штука` },
                  ],
                },
                {
                  id: '7.6 ',
                  text: `Запрещено спамить командами бота Микасы.`,
                },
                {
                  id: '7.7 ',
                  text: `Запрещены обменники руды с коэффициентами выше 1к2.`,
                },
                {
                  id: '7.8 ',
                  text: `Запрещено размещать любые молекулярные преобразователи или генераторы материи на варпах для публичного пользования.`,
                },
              ],
            },
          ],
        },
      ]
    };
  },
  methods: {
    toggleRules(categoryIndex, blockIndex) {
      this.ruleCategories[categoryIndex].blocks[blockIndex].open = !this.ruleCategories[categoryIndex].blocks[blockIndex].open;
    }
  }
};

</script>

<style scoped>

.main-container {
  max-width: 1320px;
  position: relative;
  margin-top: 64px;
  margin-inline: auto;
  padding: 0 15px;
}

@media (max-width: 768px) {
  .main-container {
    margin-top: 32px;
  }
}

</style>